{
  "test":     "It's a common idea that a comma indicates a pause where a reader or speaker should take a breath, simply adding commas when you feel a break is needed is not a reliable way to make sure you're punctuating your sentences correctly.",
  "expected": "It's a common idea that a comma indicates a pause where a reader or speaker should take a <b>breath. Simply</b> adding commas when you feel a break is needed is not a reliable way to make sure you're punctuating your sentences correctly.",
  "training": [
  [
    "I woke up late, I missed the bus and had to call a taxi to get to work on time.",
    "I woke up late. I missed the bus. I had to call a taxi to get to work on time."
  ],
  [
    "She studied all night, she was exhausted in the morning and couldn't concentrate during her important presentation.",
    "She studied all night. She was exhausted in the morning. She couldn't concentrate during her important presentation."
  ],
  [
    "The restaurant was crowded, we couldn't find a table and ended up going to a different place for dinner.",
    "The restaurant was crowded. We couldn't find a table. We ended up going to a different place for dinner."
  ],
  [
    "He loves playing basketball, he joined a local team and made new friends who share his passion.",
    "He loves playing basketball. He joined a local team. He made new friends who share his passion."
  ],
  [
    "The movie was long, it had a predictable ending and failed to keep the audience engaged.",
    "The movie was long. It had a predictable ending. It failed to keep the audience engaged."
  ],
  [
    "They went shopping, they bought new clothes and accessories for their upcoming vacation.",
    "They went shopping. They bought new clothes and accessories for their upcoming vacation."
  ],
  [
    "I finished my work early, I decided to take a break and go for a walk in the park.",
    "I finished my work early. I decided to take a break. I went for a walk in the park."
  ],
  [
    "We ordered pizza for dinner, it arrived cold and we had to microwave it before eating.",
    "We ordered pizza for dinner. It arrived cold. We had to microwave it before eating."
  ],
  [
    "She likes swimming, she goes to the pool every weekend and participates in swimming competitions.",
    "She likes swimming. She goes to the pool every weekend. She participates in swimming competitions."
  ],
  [
    "He enjoys reading books, he prefers fantasy novels and spends hours immersed in imaginary worlds.",
    "He enjoys reading books. He prefers fantasy novels. He spends hours immersed in imaginary worlds."
  ],
  [
    "The dog barked loudly, it scared the mailman and caused him to drop the packages.",
    "The dog barked loudly. It scared the mailman. It caused him to drop the packages."
  ],
  [
    "They argued about politics, they couldn't find a common ground and decided to change the topic.",
    "They argued about politics. They couldn't find a common ground. They decided to change the topic."
  ],
  [
    "She baked a cake for the party, it turned out delicious and received many compliments from the guests.",
    "She baked a cake for the party. It turned out delicious. It received many compliments from the guests."
  ],
  [
    "I went for a run, I felt energized afterwards and accomplished more tasks throughout the day.",
    "I went for a run. I felt energized afterwards. I accomplished more tasks throughout the day."
  ],
  [
    "The sun was shining brightly, it was a perfect day for a picnic and the whole family enjoyed outdoor games.",
    "The sun was shining brightly. It was a perfect day for a picnic. The whole family enjoyed outdoor games."
  ]
]
}
