{
  "test":     "I do not think it is going to work.",
  "expected": "I <b>don't</b> think <b>it's</b> going to work.",
  "training": [

  [
    "Do not press the Back button while the order is processing. You may be charged twice. You will not be able to get a refund.",
    "Don't press the Back button while the order is processing. You may be charged twice. You won't be able to get a refund."
  ],
  [



"It is important to create regular backups of your data. If you do not, you might lose important information in the event of a system failure.",
"It's important to create regular backups of your data. If you don't, you might lose important information in the event of a system failure."


],
[
"You should not use the same password for multiple accounts. If one account is compromised, others will be at risk as well.",
"You shouldn't use the same password for multiple accounts. If one account is compromised, others will be at risk as well."
],
[
"It is recommended that you update your software regularly. This will ensure that you have the latest security patches and features.",
"It's recommended that you update your software regularly. This will ensure that you have the latest security patches and features."
],
[
"When developing an application, do not hard-code sensitive information, such as passwords or API keys. Instead, use secure methods for storing and retrieving this data.",
"When developing an application, don't hard-code sensitive information, such as passwords or API keys. Instead, use secure methods for storing and retrieving this data."
],
[
"If you are not familiar with a programming language or technology, do not be afraid to ask for help. There are many resources available to assist you.",
"If you're not familiar with a programming language or technology, don't be afraid to ask for help. There are many resources available to assist you."
],
[
"To ensure code quality, do not forget to write unit tests for your software. This will help catch bugs before they become larger issues.",
"To ensure code quality, don't forget to write unit tests for your software. This will help catch bugs before they become larger issues."
],
[
"It is crucial to optimize your website for mobile devices. Many users access the internet primarily through their smartphones.",
"It's crucial to optimize your website for mobile devices. Many users access the internet primarily through their smartphones."
],
[
"If your application is not working as expected, do not hesitate to consult the documentation or seek help from your peers.",
"If your application isn't working as expected, don't hesitate to consult the documentation or seek help from your peers."
],
[
"You should not ignore error messages or warnings during development. They can provide valuable insights into potential issues with your code.",
"You shouldn't ignore error messages or warnings during development. They can provide valuable insights into potential issues with your code."
],


[
"You should not use outdated software as it may have security vulnerabilities that can be exploited by hackers.",
"You shouldn't use outdated software as it may have security vulnerabilities that can be exploited by hackers."
],
[
"When debugging, do not rely solely on your intuition. Make use of debugging tools and techniques to pinpoint the issue.",
"When debugging, don't rely solely on your intuition. Make use of debugging tools and techniques to pinpoint the issue."
],
[
"It is essential to validate user input to prevent security risks, such as SQL injection attacks or cross-site scripting.",
"It's essential to validate user input to prevent security risks, such as SQL injection attacks or cross-site scripting."
],
[
"You do not have to be an expert in every programming language. Focus on mastering a few and learning the fundamentals of others.",
"You don't have to be an expert in every programming language. Focus on mastering a few and learning the fundamentals of others."
],
[
"It is important to follow best practices when it comes to code organization and structure. It will make your code easier to read and maintain.",
"It's important to follow best practices when it comes to code organization and structure. It'll make your code easier to read and maintain."
],
[
"You should not use global variables excessively. They can make the code harder to understand and maintain.",
"You shouldn't use global variables excessively. They can make the code harder to understand and maintain."
],
[
"Do not be afraid to refactor your code when necessary. It can improve readability, maintainability, and performance.",
"Don't be afraid to refactor your code when necessary. It can improve readability, maintainability, and performance."
],
[
"It is better to write clean and modular code than to focus solely on optimizing for performance.",
"It's better to write clean and modular code than to focus solely on optimizing for performance."
],
[
"You should not rely only on automated testing. Manual testing is also important to ensure the quality of your software.",
"You shouldn't rely only on automated testing. Manual testing is also important to ensure the quality of your software."
],
[
"It is crucial to keep up with new trends and technologies in software engineering to stay relevant in the field.",
"It's crucial to keep up with new trends and technologies in software engineering to stay relevant in the field."
]



  ]
}
