{
  "test":     "Common fruits include apples, bananas and oranges.",
  "expected": "Common fruits include apples, <b>bananas,</b> and oranges.",
  "training": [
    [
      "The oxford comma is fun, useful and necessary. It makes writing clearer, better and easier to read.",
      "The oxford comma is fun, useful, and necessary. It makes writing clearer, better, and easier to read."
    ],
    [
      "At a conference, you can talk, work and meet people. The days are long, fun and tiring. Try going to a conference in a different city.",
      "At a conference, you can talk, work, and meet people. The days are long, fun, and tiring. Try going to a conference in a different city."
    ],
    [
      "Cats are cute. Cats like eating, sleeping and playing. They make good pets. Dogs, cats, fish and birds are common pets. Each type of animal has benefits, considerations and a different type of diet. If you have many pets, you need to provide them with food, water and enrichment activities. Having a goldfish does not require a lot of work. Goldfish need water, food and decorative pirate ships in their tanks. Do you have a goldfish? You need to feed it, clean its tank and buy aquarium decorations. The goldfish will be happy!",
      "Cats are cute. Cats like eating, sleeping, and playing. They make good pets. Dogs, cats, fish, and birds are common pets. Each type of animal has benefits, considerations, and a different type of diet. If you have many pets, you need to provide them with food, water, and enrichment activities. Having a goldfish does not require a lot of work. Goldfish need water, food, and decorative pirate ships in their tanks. Do you have a goldfish? You need to feed it, clean its tank, and buy aquarium decorations. The goldfish will be happy!"
    ],
    [
      "Baking a cake is fun, tasty and rewarding. You need ingredients, including flour, sugar, butter and milk. The baking process includes mixing, cracking eggs, measuring and tasting. Why is cake good? Cake is good because it is sweet, moist and has icing. Some people, however, do not like cake. Many bakeries sell cake, cookies, cupcakes and coffee. However, not everything that a bakery sells begins with \"c\". You can also find turnovers, tarts and tortes.",
      "Baking a cake is fun, tasty, and rewarding. You need ingredients, including flour, sugar, butter, and milk. The baking process includes mixing, cracking eggs, measuring, and tasting. Why is cake good? Cake is good because it is sweet, moist, and has icing. Some people, however, do not like cake. Many bakeries sell cake, cookies, cupcakes, and coffee. However, not everything that a bakery sells begins with \"c\". You can also find turnovers, tarts, and tortes."
    ],
    [
      "When writing, it's good to have a style guide, grammar knowledge and a huge vocabulary. Actually, the huge vocabulary is not necessary. Simple words are better and easier to read.",
      "When writing, it's good to have a style guide, grammar knowledge, and a huge vocabulary. Actually, the huge vocabulary is not necessary. Simple words are better and easier to read."
    ],
    [
      "Every writer needs different things, but there are some things we all need. To start writing, you need tools, ideas and words. Historical writing tools include quill pens, ink and parchment. Shakespeare used these to create comedies, tragedies, histories and other plays. Shakespeare's plays are still performed today. Later on, writers used ball point pens, pencils and later, typewriters. Some writers use these tools today. It is hard to find typewriter ink, but it is easy to buy pencils. Writers today use computers, AI and LLMs to write. These tools help writers work faster and produce more work.",
      "Every writer needs different things, but there are some things we all need. To start writing, you need tools, ideas, and words. Historical writing tools include quill pens, ink, and parchment. Shakespeare used these to create comedies, tragedies, histories, and other plays. Shakespeare's plays are still performed today. Later on, writers used ball point pens, pencils, and later, typewriters. Some writers use these tools today. It is hard to find typewriter ink, but it is easy to buy pencils. Writers today use computers, AI, and LLMs to write. These tools help writers work faster and produce more work."
    ],
    [
      "Portland is famous for rain, coffee and hipsters. Portland has many coffee shops, outdoor activites and beautiful sites. Visitors come to Portland from Oregon, Washington, California and other places.",
      "Portland is famous for rain, coffee, and hipsters. Portland has many coffee shops, outdoor activites, and beautiful sites. Visitors come to Portland from Oregon, Washington, California, and other places."
    ],
    [
      "Visiting a cat cafe is a unique experience. You drink wine, eat pastries and pet cats. Some cats and kittens are available for adoption.",
      "Visiting a cat cafe is a unique experience. You drink wine, eat pastries, and pet cats. Some cats and kittens are available for adoption."
    ],
    [
      "People visit coffee shops for many reasons. Caffeine, company and a place to work are some of the reasons.",
      "People visit coffee shops for many reasons. Caffeine, company, and a place to work are some of the reasons."
    ]
  ]
} 
