{
  "test": "Please ensure that your code is properly formatted before submitting a pull request. Use an auto-formatter, such as Prettier, to help with this process. Additionally, please verify that your changes do not introduce any linting errors.",
  "expected": "Ensure that your code is properly formatted before submitting a pull request. Use an auto-formatter, such as Prettier, to help with this process. Additionally, verify that your changes do not introduce any linting errors.",
  "training": [
    [
      "Please sign up for an account. Your username can be your email address. Remember please to create a secure password. Don't share your password with anyone. Don't log in to your account on public computers, please.",
      "Sign up for an account. Your username can be your email address. Remember to create a secure password. Don't share your password with anyone. Don't log in to your account on public computers."
    ],
    [
      "Please ensure that your code is properly formatted before submitting a pull request. Use an auto-formatter, such as Prettier, to help with this process. Additionally, please verify that your changes do not introduce any linting errors.",
      "Ensure that your code is properly formatted before submitting a pull request. Use an auto-formatter, such as Prettier, to help with this process. Additionally, verify that your changes do not introduce any linting errors."
    ],
    [
      "When developing a new feature, please begin by creating a feature branch based on the latest version of the main branch. This helps to keep the development process organized and reduces conflicts when merging your changes back into the main branch.",
      "When developing a new feature, begin by creating a feature branch based on the latest version of the main branch. This helps to keep the development process organized and reduces conflicts when merging your changes back into the main branch."
    ],
    [
      "Please make sure to include unit tests for any new functionality you implement. This will help ensure that the code behaves as expected and will make it easier for other developers to understand and maintain your code.",
      "Make sure to include unit tests for any new functionality you implement. This will help ensure that the code behaves as expected and will make it easier for other developers to understand and maintain your code."
    ],
    [
      "Before submitting a pull request, please run a performance analysis to ensure that your changes do not introduce any performance regressions. If you notice any slowdowns, please optimize your code before submitting your changes.",
      "Before submitting a pull request, run a performance analysis to ensure that your changes do not introduce any performance regressions. If you notice any slowdowns, optimize your code before submitting your changes."
    ],
    [
      "When working with APIs, please adhere to the RESTful design principles to ensure that the API is easy to use and maintain. This includes using standard HTTP methods, proper URL structures, and clear error messages.",
      "When working with APIs, adhere to the RESTful design principles to ensure that the API is easy to use and maintain. This includes using standard HTTP methods, proper URL structures, and clear error messages."
    ],
    [
      "Please use the appropriate version control system for your project, such as Git or Subversion. This will help track changes to the codebase, make collaboration easier, and provide a safety net in case of mistakes.",
      "Use the appropriate version control system for your project, such as Git or Subversion. This will help track changes to the codebase, make collaboration easier, and provide a safety net in case of mistakes."
    ],
    [
      "When refactoring code, please take the time to update any outdated comments or documentation. This will help ensure that the information remains accurate and up-to-date for other developers working on the project.",
      "When refactoring code, take the time to update any outdated comments or documentation. This will help ensure that the information remains accurate and up-to-date for other developers working on the project."
    ],
    [
      "Please use a bug tracking system, such as Jira or Bugzilla, to report and track issues. This will help the team prioritize and address problems more efficiently and improve the overall quality of the software.",
      "Use a bug tracking system, such as Jira or Bugzilla, to report and track issues. This will help the team prioritize and address problems more efficiently and improve the overall quality of the software."
    ]
  ]
}
