{
  "test":     "In this chapter we learn how to query the database.",
  "expected": "In this chapter <b>you</b> learn how to query the database.",
  "training": [
    [
      "First, we write the rules. Then we train the LLM. Finally, Hank does what we want.",
      "First, you write the rules. Then you train the LLM. Finally, Hank does what you want."
    ],
    [
      "If we want to train the LLM, we need to teach it a lot of material.",
      "If you want to train the LLM, you need to teach it a lot of material."
    ],
    [
      "We need to make a list of things we want to see in Portland. We can have fun visiting the city.",
      "You need to make a list of things you want to see in Portland. You can have fun visiting the city."
    ],
    [
      "If we're baking a cake, we need to go to the grocery store first. We can buy the ingredients we need there.",
      "If you're baking a cake, you need to go to the grocery store first. You can buy the ingredients you need there."
    ],
    [
      "When we get to the grocery store, we decide whether we need a cart or a basket. If we have a lot to buy, we need a cart.",
      "When you get to the grocery store, decide whether you need a cart or a basket. If you have a lot to buy, you need a cart."
    ],
    [
      "We already made a shopping list, so we know what we need to buy. If we're lucky, some of the ingredients we need are on sale. We can bake the cake more cheaply.",
      "You already made a shopping list, so you know what you need to buy. If you're lucky, some of the ingredients you need are on sale. You can bake the cake more cheaply."
    ],
    [
      "After paying for the groceries and getting out our ingredients, we start the baking process. Get out a mixing bowl, a mixer, and a wooden spoon.",
      "After paying for the groceries and getting out your ingredients, start the baking process. Get out a mixing bowl, a mixer, and a wooden spoon."
    ],
    [
      "We mix the butter, sugar, eggs, flour, salt, and other ingredients in a large bowl. We want the batter to be completely mixed, with no lumps.",
      "You mix the butter, sugar, eggs, flour, salt, and other ingredients in a large bowl. You want the batter to be completely mixed, with no lumps."
    ],
    [
      "If we're making a marble cake, we divide the batter into chocolate and vanilla. Melt some chocolate in the microwave for the chocolate part.",
      "If you're making a marble cake, you divide the batter into chocolate and vanilla. Melt some chocolate in the microwave for the chocolate part."
    ],
    [
      "We've preheated the oven, and put the batter in the pan. Next, we place the pan in the oven.",
      "You've preheated the oven, and put the batter in the pan. Next, you place the pan in the oven. "
    ],
    [
      "The next few minutes are crucial for the success of our project. Even though we want to peek at our cake, we leave the oven closed.",
      "The next few minutes are crucial for the success of your project. Even though you want to peek at your cake, leave the oven closed."
    ],
    [
      "While the cake is baking, we need to wash the dishes. We may not want to do this, but it's important. A clean kitchen is a happy kitchen.",
      "While the cake is baking, you need to wash the dishes. You may not want to do this, but it's important. A clean kitchen is a happy kitchen."
    ],
    [
      "If we want to see whether the cake is finished baking, we use a cake tester or a toothpick. We remove the cake from the oven if there are moist crumbs clinging to the tester. If the cake is not finished yet, we bake it for five more minutes.",
      "If you want to see whether the cake is finished baking, you use a cake tester or a toothpick. Remove the cake from the oven if there are moist crumbs clinging to the tester. If the cake is not finished yet, bake it for five more minutes."
    ],
    [
      "Let the cake cool on a wire rack for at least 20 minutes. We can't take a hot cake out of the pan. The cake falls apart, and we cry.",
      "Let the cake cool on a wire rack for at least 20 minutes. You can't take a hot cake out of the pan. The cake falls apart, and you cry."
    ],
    [
      "Do we want to put icing on our cake? This cake is a pound cake, so it doesn't need icing. Some people put icing on pound cakes.",
      "Do you want to put icing on your cake? This cake is a pound cake, so it doesn't need icing. Some people put icing on pound cakes."
    ],
    [
      "We've finally reached the moment we've been waiting for: eating the cake! Grab a plate, a fork, and a large serrated knife.",
      "You've finally reached the moment you've been waiting for: eating the cake! Grab a plate, a fork, and a large serrated knife."
    ],
    [
      "At last, we can enjoy the fruits of our labor in the form of a big, delicious slice of cake. Eat the cake with a glass of milk or a cup of tea. Enjoy!",
      "At last, you can enjoy the fruits of your labor in the form of a big, delicious slice of cake. Eat the cake with a glass of milk or a cup of tea. Enjoy!"
    ],
    [
      "First, we write the rules. Then we train the LLM. Finally, Hank does what we want. If we want to train the LLM, we need to teach it a lot of material. We need to make a list of things we want to see in Portland. We can have fun visiting the city. If we're baking a cake, we need to go to the grocery store first. We can buy the ingredients we need there. When we get to the grocery store, we decide whether we need a cart or a basket. If we have a lot to buy, we need a cart.",
      "First, you write the rules. Then you train the LLM. Finally, Hank does what you want. If you want to train the LLM, you need to teach it a lot of material. You need to make a list of things you want to see in Portland. You can have fun visiting the city. If you're baking a cake, you need to go to the grocery store first. You can buy the ingredients you need there. When you get to the grocery store, decide whether you need a cart or a basket. If you have a lot to buy, you need a cart."
  ]
} 
